[33md2a064d[m[33m ([m[1;36mHEAD -> [m[1;32mmain[m[33m, [m[1;31morigin/main[m[33m, [m[1;31morigin/HEAD[m[33m)[m 애니메이션 트랙 구현직전 커밋
[33med923a1[m 스키닝 애니메이션 구현 git add .
[33m20d4c39[m 구현중
[33m4af5a40[m 프레임 곱창나네 씨발
[33m79d0598[m 스키닝 테스트 아직 못함
[33m0e618ec[m Assimp Anim Impl
[33m008e29c[m Dynamic Mesh Good
[33m82b51bc[m 다이나믹 메쉬 버그
[33mb96cb34[m Dynamic Mesh 구현 하였으나 테스트 필요함
[33m238456c[m Render 컬링
[33mc52121b[m 정리종료
[33mfb3aac3[m 더미 코드 정리중
[33me87c746[m 스키닝 애니메이션 소프트웨어로 전환중
[33m261aeee[m Loader 작성중
[33md1ba787[m DynamicMesh Implementation
[33m728a6ad[m  DynamicMesh 작성중
[33m724e4b1[m Bug
[33m9871477[m Shader 작성중
[33mf952650[m Animation Time
[33mb1f981d[m Assimp Animation
[33m2746968[m 데이터 로딩중
[33mf3c1324[m Assimp
[33m7728474[m Update README.md
[33m7775d68[m Load Assimp Material Loader
[33m95d2b14[m[33m ([m[1;33mtag: 0.1[m[33m)[m Assimp Debuger
[33md0cd151[m Readme assimp information update
[33m5edb271[m Merge branch 'main' of https://github.com/Aeopp/3DGame
[33med7dbe2[m Assimp Bone Test Print Log
[33m022eeb1[m Update README.md
[33m8ea57bb[m Update README.md
[33m5635aa5[m Update README.md
[33m2650566[m opengl skining tutorial 공부하다 중지
[33mffbe1a2[m Model
[33m687d4d0[m  Model..
[33m795cdaf[m Model
[33md97ba82[m Assimp Implementation:
[33mff7e299[m assimp include directory change
[33mb0bf0cb[m ASSIMP LIB Directory Change
[33ma856e98[m ASSIMP Cmake Build Lib File Upload
[33m928e3b1[m Update README.md
[33m88dbe8f[m  트랜스폼 기저벡터 갱신 조금 최적화
[33m3fe0968[m Transform 수정전 커밋
[33m2285b29[m Engine Global Header add
[33m5184289[m  OBB 충돌 SA 분리축 후보중 모서리 vs 모서리 계산을 제외해서 최적화
[33mbe83b32[m Push2
[33mc10b901[m 도형 밀어내기 끝
[33m26b2cc3[m SAT 이론 최대한 최적화
[33mba2cf23[m OBB 밀어내기 구현
[33md2d74cf[m 충돌체 밀어내기 구현 직전
[33mc54b2ab[m OBB 구현
[33m6a8d558[m 트랜스폼 변경전 커밋
[33m5811ee1[m OBB 구현중
[33md46560f[m Link Error2
[33m649bc1f[m Amend Commit
[33m479ab13[m Debug Mode Create
[33md156c76[m Component Prototype 으로 바꾸기전 커밋
[33m23ae7ba[m Transform Update
[33mfedf48a[m Home
[33m705e552[m Renderer
[33m921b138[m Renderer Parrlel
[33m22458b7[m Collision Update
[33mf560008[m Collision
[33md5ceeb4[m Collision
[33ma6e09ad[m Stone Rendering
[33mb08abe9[m Good
[33m6d97187[m Resource Sys
[33m918745f[m TombStone
[33m2e1ee51[m memory leak
[33me84c4a5[m texture load
[33m3585a8d[m resource system
[33m2c22e9a[m Resource
[33m607a695[m resource system
[33m5eb4ea3[m ...
[33mf2139ff[m statc mesh ...
[33m274e625[m Mesh Static Mesh Init
[33mfe6e7e3[m Commit Test
[33m6f87bab[m ...
[33m409e523[m 절두체 컬링 구현 완료 테스팅 완료
[33m48f22be[m ..
[33mfa9a894[m 절두체 클래스 작성중
[33m18b0535[m 렌더러 클래스 동시성 프로그래밍 적용중.
[33m5231490[m 메모리 릭 발견하여서 이슈 수정,
[33mce1310b[m 트랜스폼 수정이전 커밋버전
[33m4dbdcc0[m FindObject 예외사항 적용.
[33ma4f1420[m ImGui 연동하고 씬전환까지 구현.
[33m4edfedb[m ImGui 연동 완료
[33m937546e[m IMGUI 적용전 커밋
[33m43f24fc[m 클라이언트와 엔진 리소스까지의 경로 통일
[33m92b4b91[m ..리소스 경로 통일 직전
[33m97d9091[m 리소스 매니저 정상작동 확인.
[33md204458[m 리소스 매니저 테스트 완료.
[33m43d3c0a[m 리소스 가변인자 버전
[33m3fbedae[m 리소스 매니저 튜플
[33mb7896a6[m 리소스 매니저 작성 테스트는 아직.
[33m513f639[m 다이나믹 카메라 테스트 이전
[33m08bd30f[m 트랜스폼 작성 테스트는 아직.
[33m4a3e437[m FMath 작성 하였으나 테스트는 하지 않았음 사소한 버그가 존재할 가능성.
[33mb62ef74[m Camera .h
[33m47cfaea[m ..
[33mbf71b9d[m[33m ([m[1;31morigin/Assignment[m[33m)[m 이제 링커가 증분링크를 사용하며 최소 다시 빌드 기능은 다중 프로세서 컴파일 옵션과 호환되지 않으므로 해제
[33m04e2489[m 병합완료.
[33m2c83733[m 메인과 병합전 커밋
[33m110a3b2[m 과제 3인칭 카메라 버전으로 종료.
[33m19a7835[m 1인칭 카메라버전 과제
[33m66bcebb[m 지형타는것과 큐브맵까지 구현한 과제.
[33m1717240[m 게임루프 바뀐이후 테스트까지 끝마치고 커밋
[33m500a704[m 델타타임 게임 루프 개선.
[33mfb80117[m 인풋 매니저 업데이트 루프 통제
[33m5344ace[m 키매니저 사용하기 편한 인터페이스로 구현
[33md086dff[m  런타임 라이브러리CRT 힙 공유 문제 해결을 위해 정적라이브러리 사용에서 DLL 사용으로 변경
[33mb9ed741[m 폰트매니저까지 구현완료,
[33m3ccc308[m 폰트매니저 작성
[33m3062c27[m 폰트객체까지 구현 테스트는 해보지 않은 상태.
[33m8750b4d[m 프로토타입 시스템까지 연동.
[33m4493e85[m 프레임워크 작성중
[33m632aeb8[m 엔진 프레임워크
[33md730ab4[m 하이트맵구현이끝난커밋
[33m823f0e2[m 하이트맵 빠르게 구현완료.
[33m7287d21[m 높이맵 구현 직
[33m41d3ef7[m Shader 클래스는 구현을 마쳤으나 Shader 관리 클래스의 구현부는 구현 직전.
[33mc7bcf09[m 그래픽 디바이스는 쉐이더를 소유해야
[33m064c24a[m Shader 작성
[33me41422a[m 싱글턴 구조 갈아엎는중..
[33m2ffabad[m 싱글턴 구조 갈아엎기 직전
[33mf4c8345[m Vertexs 작성
[33mf9e1eac[m 유틸리티 쉐이더 작성 직전
[33m0f5d190[m 렌더러 클래스 작성중
[33me2b7ce1[m unique_ptr 이동생성자 문제 해결.
[33m70a76ea[m ..
[33ma41850d[m 하이트맵 1인칭 카메라 구현하기 이전.
[33mb4929dc[m DLL 프로젝트 싱글턴 문제 해결중..
[33m61d4d8c[m Sound 까지 추가 테스트는 아직.
[33m837a3f6[m Controller Done.
[33m081017a[m 엔진 종속적인 구조로 변경
[33m6619903[m 클라이언트 초기화 로직에서 매니지먼트 초기화 로직으로 변경 직전
[33mdad2fb4[m 계속 작성중
[33m44ad427[m 링크에러 해결.
[33mcd5a7df[m 링크에러
[33md4a0f56[m 프로젝트 외부에 리소스 폴더 만듬
[33m7c7ce71[m 작성중
[33m7fcf301[m 컴포넌트 시스템
[33m3b4f623[m Layer Add
[33m654dccc[m 매니지먼트
[33ma3c0f4f[m 매니지먼트 씬 구현중
[33mb4524a0[m App
[33m06f5298[m Client App
[33m3fececa[m 타이머.
[33m9f4f99c[m 그래픽 디바이스.
[33mf9cd92b[m 클라 출력 디렉터리 Run 으로 수정
[33mc81ea2a[m Project Initialize
[33m4c5ee12[m git ignore remend
[33m7d1bb6e[m Initial commit
